#+exclude_tags: pandoc

This is the artifact of /Derivative-Guided Symbolic Execution/ under
submission to POPL 2025.  The derivative-guided symbolic execution
engine *HATch*, along with its derivative-free variant, are provided.
Please follow the instructions below for installation and reproduction
of experiment results.

* Experiments

The data of Table 1 in the paper is produced
using [[https://orgmode.org/worg/org-contrib/babel/][org-babel shipped with Emacs]] and shown below.

|-------------------------------------+-------+---------+---------+-------+-------|
| program                             | HATch | SpeedUp | SpeedUp | Naive |   HAT |
|-------------------------------------+-------+---------+---------+-------+-------|
| Stack_LinkedList/cons               |  0.51 | \times4.9    | \times3.2    |  2.50 |  1.64 |
| Stack_LinkedList/concat_aux         |  0.25 | O/M     | \times13.2   |   O/M |  3.29 |
| Stack_KVStore/cons                  |  1.11 | T/O     | \times4.6    |   T/O |  5.09 |
| Stack_KVStore/concat_aux            |  0.94 | O/M     | \times6.5    |   O/M |  6.08 |
| Queue_LinkedList/append             |  0.73 | \times2.5    | \times2.7    |  1.85 |  1.97 |
| Queue_Graph/append                  |  1.75 | T/O     | \times7.4    |   T/O | 12.89 |
| Set_KVStore/insert                  |  0.87 | T/O     | \times1.4    |   T/O |  1.25 |
| Set_Tree/insert_aux                 |  1.10 | \times40.7   | \times11.1   | 44.72 | 12.24 |
| Heap_LinkedList/insert_aux          |  0.11 | \times12.9   | \times13.2   |  1.42 |  1.45 |
| Heap_Tree/insert_aux                |  1.00 | \times2.4    | \times2.5    |  2.44 |  2.50 |
| MinSet_Set/minset_singleton         |  1.14 | \times1.3    | \times1.3    |  1.48 |  1.50 |
| MinSet_Set/minset_insert            |  1.32 | \times9.0    | \times9.9    | 11.93 | 13.10 |
| MinSet_KVStore/minset_singleton     |  0.66 | T/O     | \times4.3    |   T/O |  2.83 |
| MinSet_KVStore/minset_insert        |  1.95 | \times10.7   | \times14.9   | 20.79 | 29.04 |
| LazySet_Tree/insert_aux             |  1.09 | \times4.8    | \times11.5   |  5.25 | 12.58 |
| LazySet_Set/lazy_insert             |  0.49 | \times1.2    | \times1.3    |  0.60 |  0.65 |
| LazySet_KVStore/insert_aux          |  0.88 | \times49.8   | \times1.5    | 43.81 |  1.34 |
| DFA_KVStore/add_transition          |  0.66 | \times29.9   | \times29.9   | 19.73 | 19.72 |
| DFA_KVStore/del_transition          |  1.04 | \times15.0   | \times15.2   | 15.60 | 15.86 |
| DFA_Graph/add_transition            |  0.98 | \times12.9   | \times12.8   | 12.62 | 12.51 |
| DFA_Graph/del_transition            |  0.97 | \times16.5   | \times16.5   | 15.96 | 16.05 |
| ConnectedGraph_Set/singleton        |  0.27 | T/O     | \times16.4   |   T/O |  4.44 |
| ConnectedGraph_Set/add_node         |  1.31 | O/M     | \times9.9    |   O/M | 12.96 |
| ConnectedGraph_Set/add_transition   |  1.44 | O/M     | \times11.2   |   O/M | 16.07 |
| ConnectedGraph_Graph/singleton      |  1.13 | \times1.7    | \times1.8    |  1.97 |  1.99 |
| ConnectedGraph_Graph/add_node       |  2.05 | \times6.0    | \times6.1    | 12.37 | 12.47 |
| ConnectedGraph_Graph/add_transition |  2.38 | \times20.0   | \times16.2   | 47.58 | 38.53 |
| ColoredGraph_Graph/add_edge         |  3.68 | T/O     | T/O     |   T/O |   T/O |
| ColoredGraph_KVStore/add_edge       |  7.82 | T/O     | T/O     |   T/O |   T/O |
| LinkedList_KVStore/remove           |  7.03 | O/M     | T/O     |   O/M |   T/O |
|-------------------------------------+-------+---------+---------+-------+-------|
#+TBLFM: $5='(org-sbe "naive" (path $$1))::$2='(org-sbe "hatch" (path $$1))::$6='(org-sbe "verify" (path $$1))
#+TBLFM: $3='(org-sbe "ratio" (x $$5) (y $$2))::$4='(org-sbe "ratio" (x $$6) (y $$2))

One may regenerate the content of the table in place using the
following script assuming a recent installation of =Emacs= and =pandoc=.

#+begin_src shell
  emacs --batch -l ob -l ob-shell --eval "
    (let ((org-confirm-babel-evaluate nil))
      (dolist (file command-line-args-left)
        (with-current-buffer (find-file-noselect file)
          (org-table-recalculate-buffer-tables)
          (save-buffer))))
  " README.org
  pandoc -s README.org -o README.md
#+end_src

